Repository: bourbaki/squashbot
Catalog: squashbot/locale/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Hi fellow squasher! Please choose the location of the game.
ru_ru: Новая игра! Замечательно! Где играли?

source: You played on {date}. What time have the game ended?
ru_ru: Здорово! Играли {date} Во сколько?

source: Courts are good at {}. When game is played? Let's start with date.
ru_ru: {}. Хороший выбор! Какого числа играли?

source: Nice. The game is ended at {}. Who's the first player?
ru_ru: Супер! Играли {}. Настал час выбрать первого игрока!

source: Well done. We like {}. Who was his mathup?
ru_ru: {} в красном углу ринга! Кто ему противостоит?

source: Well done. And the result of {} - {} is?
ru_ru: {} - {}. Баталия на века! Какой счет?

source: Let's check. {} {} {} - {} {}.
ru_ru: Уже близко! Финальная проверка: {} {} {} - {} {}. Все ОК?

source: Sorry, I work only in private chats.
ru_ru: Пиши в личку!

source: Sorry, I don't understand only text.
ru_ru: Сорри, понимаю только текстовые сообщения. Кому-то было лень писать обработчики для аудио, видео и гифок. Да, @bourbaki?

source: You are already in process of entering the results!
ru_ru: Ты же уже вводишь результаты. Если хочешь отменить текущий ввод — /cancel

source: Sorry, bro, but you are not a member of the league chat.
ru_ru: Вынужден огорчить. Не могу найти тебя в чате лиги и разрешить тебе вводить результаты. Предполагаю, ты знаешь, к кому обратиться, чтобы тебя добавили в чат.

source: Nothing to cancel. You don't even started
ru_ru: Чтобы что-то отменить, надо начать что-то делать.

source: Ok. Full Reset! Start enter new game with /newgame
ru_ru: Как скажешь. Начнем все сначала. Чтобы снова начать ввод — /newgame.

source: Oh, we can't go back darling. We've just started... Do you mean /cancel?
ru_ru: Мы только начали! Если хочешь отменить ввод — /cancel.

source: Sorry, I don't know about this place. If this place is new, please contact administrators to add this court to our list.
ru_ru: Это где? Впервые слышу! Уверен, что твоего корта нет в списке?

source: Sorry, I cannot recognize the date. You can input custom date in 12.12.12 format
ru_ru: Не очень похоже на дату. Попробуй что-нибудь похожее на 12.10.16

source: Looks like your game is in the future! No time travelers allowed!
ru_ru: Ты из будущего? Тогда записывайся в Лигу Путешественников во времени! В другом случае постарайся выбрать дату из прошлого.

source: Sorry, I cannot recognize time. Please post something like 15:45 or 24.10.2016 13:20.
ru_ru: Странное время. Попробуй что-нибудь похожее на 15:45 .

source: I don't know that man!!! I suggested some names for you below
ru_ru: Кто это такой? В списке лиги таких нет. Точно нет в списке? Если действительно нет, обратись к админам, и они добавят нового сквошиста!

source: Strange result! Try something look like 3:1.
ru_ru: Странный результат! В лиге мы играем до трех побед. Попробуй что-нибудь похожее на 3:1.

source: Please confirm the result!
ru_ru: Нужно подтвердить результат!

source: Well done! We'll notify everyone about the game! Enter new game with /newgame.
ru_ru: Ура! Игра зачтена! В общий чат Лиги придет оповещение с результатом и изменениями в рейтинге! Удачи!

source: {} has just posted new results. {} {} {} - {} {} *{:+.2f}*
ru_ru: {} опубликовал новые результаты. {} {} {} - {} {} *{:+.2f}*
